Revit 2027 API
Alignment.Get Method
Overload List
Name | Description
Get(Element) |  Returns an Alignment object given a Revit alignment element.
Get(Document, Guid) |  Returns an Alignment in the document given its GUID.
Top
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace